{
  "recipes": [
    {
      "id": 1,
      "img": "https://preview.redd.it/b86fxdpltga51.jpg?auto=webp&s=8384714932f8f675c4bb27aa14d854935a7a5bae",
      "video": "",
      "name": "Meat Lovers Skillet",
      "source": "",
      "author": "Amanda",
      "mealtype": "Breakfast",
      "preptime": "15",
      "cooktime": "15",
      "servings": "2",
      "comments": [
        "From Amanda's trip to Austin, TX.",
        "Sometimes we cook the meat and onion together to save some time",
        "Love this recipe!"
      ],
      "instructions": [
        "Start with frying frozen hash browns in a hot skillet. Season with garlic powder, onion powder, salt and pepper. Flip when brown and crispy.",
        "Cut up sausage and bacon, then fry in hot pan with oil. Dice red onion, add to pan. Shred smoked gouda while red onion softens.",
        "Once meat is browned and onions are soft, scramble 4 eggs and pour pan.",
        "When the egg is almost done cooking, add cheese and toss until melted. Serve over hash browns and drizzle with BBQ sauce."
      ],
      "ingredients": [
        "1/4 cup canola oil, split",
        "3 cups frozen hash browns (about half a bag)",
        "1/2 tsp garlic powder",
        "1/2 tsp onion powder",
        "salt and pepper to taste",
        "4 sausage links",
        "4 slices bacon",
        "1/2 red onion",
        "1/2 cup smoked gouda cheese",
        "4 eggs",
        "BBQ sauce (Lilly Q's smoked)"
      ],
      "tags": [
        "breakfast",
        "Walsh approved",
        "fast"
      ]
    },
    {
      "id": 2,
      "img": "https://natashaskitchen.com/wp-content/uploads/2020/05/Chocolate-Chip-Cookies-Recipe-500x375.jpg",
      "video": "",
      "name": "Copycat Levain Bakery Chocolate Chip Cookies",
      "source": "https://bromabakery.com/copycat-levain-bakery-chocolate-chip-cookies",
      "author": "Broma Bakery",
      "mealtype": "Snack",
      "preptime": "10",
      "cooktime": "15",
      "servings": "12",
      "comments": [
        "Switch the baking soda and baking powder amounts for a better cookie!",
        "Freeze dough in portions on a cookie sheet and package together once frozen.",
        "Undercook the cookie for best results.",
        "These cookies are GREAT!"
      ],
      "instructions": [
        "Line a large baking sheet with a silicon mat or parchment paper. Set aside.",
        "In a medium bowl, mix together the flour, baking soda, powder, and salt. Set aside.",
        "In a standing mixer fitted with a paddle attachment, beat the butter until it comes together in one lump, about 1 minute. Add in the sugars and beat for another 1-2 minutes, or until the sugar dissolves into the butter. Lower the speed to medium-low, and mix in the eggs and vanilla and beat until mixed (the batter will be lumpy).",
        "Gradually add in the flour mixture, beating until a little flour remains. Fold in the chocolate chips with a rubber spatula.",
        "Divide the dough into 12 even pieces. Shape the dough roughly into a ball, but do not roll it. Place on the prepared baking sheet, spacing 2 inches apart. Refrigerate for at least 30 minutes but up to 12 hours before baking.",
        "Preheat oven to 375°F. Bake cookies for 15-20 minutes, until light golden brown. When in doubt, take your cookies out early. The cookies will continue to cook as they cool. There’s nothing that ruins them more than being overcooked.",
        "I can’t stress this enough! Cool on a wire rack, then serve!"
      ],
      "ingredients": [
        "3 cups plus 2 tablespoons all purpose flour",
        "1 teaspoon baking powder",
        "1/4 teaspoon baking soda",
        "1 1/2 teaspoons kosher salt",
        "1 cup unsalted butter, cold and cut into cubes",
        "3/4 cup + 4 teaspoons (6 ounces) light or dark brown sugar",
        "1/2 cup granulated sugar",
        "2 eggs, cold, lightly beaten in a separate bowl",
        "1 teaspoon vanilla extract",
        "2 cups dark chocolate chips (I used Ghirardelli dark chocolate baking chips)"
      ],
      "tags": [
        "dessert",
        "fast"
      ]
    },
    {
      "id": 3,
      "img": "https://www.rabbitandwolves.com/wp-content/uploads/2017/01/DSC_0006-1.jpg",
      "video": "",
      "name": "Chicken and Dumplings",
      "source": "https://www.peta.org/recipes/chicken-dumplings-2/",
      "author": "PETA",
      "mealtype": "Dinner",
      "preptime": "30",
      "cooktime": "40",
      "servings": "8",
      "comments": [
        "Use gardein chicken scallopini for the chicken.",
        "Bisquick dumplings are great with this!"
      ],
      "instructions": [
        "Combine the dry ingredients for the dumplings in a bowl. Mix the margarine with the dry mixture until crumbly. Add the soy milk, stirring until moistened. Add more soy milk, as needed, if the mixture is too dry. Knead the dough for 30 seconds on a well-floured surface, then roll to 1/8-inch thickness and cut into 1/2-inch squares.",
        "Sauté the margarine, onion, and celery for the soup in a large saucepan until the vegetables are soft. Add the flour, salt, and pepper to make a thick paste. Slowly mix in the broth and bring to a boil. Add the carrots, Chickettes, and bay leaf.",
        "Add the dumpling squares one at a time, stirring gently. Reduce the heat and simmer for 20 minutes, stirring often. Serve hot."
      ],
      "ingredients": [
        "2 cups flour",
        "1 Tbsp. baking powder",
        "1/2 tsp. salt",
        "1/2 stick (4 Tbsp.) margarine",
        "3/4 cup soy milk",
        "1/2 stick (4 Tbsp.) margarine",
        "1/2 cup onion, chopped",
        "1/2 cup celery, chopped",
        "1/2 cup flour",
        "1/4 tsp. celery salt",
        "1/2 tsp. pepper",
        "8 cups un-chicken or vegetable broth",
        "2 medium carrots, diced",
        "1 roll of Chickettes, torn into small pieces",
        "1 bay leaf"
      ],
      "tags": []
    },
    {
      "id": 4,
      "img": "https://carlsbadcravings.com/wp-content/uploads/2015/09/Lasagna-soup-6.jpg",
      "video": "",
      "name": "One Pot Lasagna Soup",
      "source": "https://carlsbadcravings.com/easy-one-pot-lasagna-soup/#wprm-recipe-container-36068",
      "author": "Carlsbad Cravings",
      "mealtype": "Lunch",
      "preptime": "10",
      "cooktime": "40",
      "servings": "8",
      "comments": [
        "We use trumpets for the noodles instead of lasagna noodles.",
        "Soup with noodles don't freeze well and aren't great reheated, so let's scale this recipe next time we make it."
      ],
      "instructions": [
        "Heat large Dutch oven/large soup pot over medium high heat. Add beef and onion and cook, stirring occasionally until beef is browned.",
        "Add garlic and red pepper flakes and saute for 30 seconds. Drain off any excess fat.",
        "Add tomato sauce, 6 cups chicken broth, crushed tomatoes, tomato paste, balsamic vinegar, sugar, spices and lasagna noodles. Bring to a boil then reduce to a simmer until lasagna noodles are tender, stirring occasionally (approximately 20-30 minutes).",
        "Discard bay leaf and stir in heavy cream (optional) and 2-4 cups chicken broth to reach desired consistency. Garnish individual servings with desired amount of cheeses."
      ],
      "ingredients": [
        "1 pound lean ground beef or half Italian sausage",
        "1 yellow onion, diced",
        "4-5 garlic cloves, minced",
        "1/2 teaspoon red pepper flakes",
        "24 oz. jar tomato sauce",
        "8-10 cups low sodium chicken broth, divided",
        "1 14 oz. can can crushed tomatoes",
        "2 tablespoons tomato paste",
        "2 teaspoons balsamic vinegar",
        "1 1/2 teaspoons granulated sugar",
        "1 tablespoon dried basil",
        "1 tsp EACH dried parsley, dried oregano, salt",
        "1/2 teaspoon pepper",
        "1 whole bay leaf",
        "10 uncooked lasagna noodles broken into approx. 1-2 inch pieces",
        "1/2 cup heavy cream,optional"
      ],
      "tags": [
        "soup",
        "hearty"
      ]
    },
    {
      "id": 5,
      "img": "https://static01.nyt.com/images/2018/11/20/dining/ar-baked-ziti/ar-baked-ziti-articleLarge.jpg",
      "video": "",
      "name": "Baked Ziti",
      "source": "https://cooking.nytimes.com/recipes/1018954-baked-ziti",
      "author": "Alison Roman",
      "mealtype": "Dinner",
      "preptime": "30",
      "cooktime": "60",
      "servings": "8",
      "comments": [],
      "instructions": [
        "Make the tomato sauce: Heat oil in a large, heavy-bottomed pot over medium heat. Add onion and garlic and season with salt and pepper. Cook, stirring occasionally, until the onion is totally softened and translucent (without letting it brown), 8 to 10 minutes. Add tomato paste and continue to cook, stirring until it has turned a deeper brick-red color, tinting the oil and onions a fiery orange color, about 2 minutes. Crush the whole tomatoes by hand and add them (including the juice) and the tomato purée to the pot, stirring to scrape up any bits from the bottom of the pot. Season with salt and pepper and add red pepper flakes, if using. Bring to a simmer and cook, stirring occasionally, until the tomato sauce has thickened and flavors have come together, 20 to 30 minutes.",
        "Prepare the filling: In a medium bowl, combine ricotta, heavy cream and 1/2 cup Parmesan. Season with salt and pepper and set aside.",
        "Prepare the pasta: As the sauce cooks, heat oven to 425 degrees, and place a large pot of salted water to boil on the stove.",
        "Cook pasta until it’s nearly al dente. (You want to undercook the pasta slightly, as it will continue to cook in the oven. A good way to do this is cook it 2 minutes less than you normally would if preparing it al dente.) Reserving 1 cup of the pasta cooking liquid, drain pasta and rinse with cool water; set aside while the tomato sauce finishes cooking.",
        "Once tomato sauce is done, stir in reserved pasta water.",
        "Place pasta in a large bowl and add 2 cups sauce. Stir to coat pasta evenly encouraging the sauce to go inside each tube.",
        "Spoon a bit of remaining sauce on the bottom of a 3-quart baking dish and top with 1/3 of the pasta. Spoon 1/3 of the remaining sauce on top, dollop with half the ricotta mixture and scatter 1/3 of the mozzarella on top of that. Repeat, beginning with the pasta, one more time. For the final layer, add the last 1/3 of pasta and the last of the sauce. Dot remaining mozzarella on top and shave a bit more Parmesan on top of that. Place baking dish on top of a sheet pan lined with parchment paper to catch any drips. Place in the oven and bake until the edges are golden brown and bubbling and the top has browned nicely, 30 to 40 minutes."
      ],
      "ingredients": [
        "1/4 cup olive oil",
        "1 large yellow onion, finely chopped",
        "4 cloves garlic, finely chopped",
        "2 Tbsp tomato paste",
        "1 28 oz can whole peeled tomatoes, packed in juice",
        "1 28 oz can tomato puree or sauce",
        "3/4 tsp red pepper flakes",
        "16 oz / 1 pound ricotta",
        "1/2 cup heavy cream",
        "1/2 cup finely grated parmesan or pecorino, plus more for topping",
        "1 pound ziti, rigatoni, penne, manicoti or other short, tube-like pasta",
        "1 pound fresh mozzarella, cut into 1/2 inch pieces"
      ],
      "tags": [
        "alison roman"
      ]
    },
    {
      "id": 6,
      "img": "https://images.food52.com/y_b--TUY1Q8MXJNxVcZhB4O9pI4=/660x440/filters:format(webp)/7cc8fa5d-b1f2-4f5e-9766-2c8105f3d21a--salad.jpg",
      "video": "",
      "name": "Grilled Corn, Basil and Ground Cherry Salad",
      "source": "https://food52.com/recipes/23474-grilled-corn-basil-and-ground-cherry-salad",
      "author": "BEVI",
      "mealtype": "Snack",
      "preptime": "10",
      "cooktime": "20",
      "servings": "4",
      "comments": [
        "So good when we get ground cherries from the farmer's market."
      ],
      "instructions": [
        "Wash the ground cherries in their husks. I have better luck removing the husks if they are moistened. Pinch the base of the husk away from the cherry - it should slide off easily.",
        "Prepare the vinaigrette by combining the olive oil, lime juice, lime zest and salt and pepper. Set aside.",
        "Place the grilled corn, ground cherries, cukes, basil, shallot, and jalapeño into a medium sized serving bowl and mix the ingredients thoroughly.",
        "Add the vinaigrette, mix all ingredients, and chill in the refrigerator."
      ],
      "ingredients": [
        "1/8 cup olive oil",
        "juice and zest of one small lime",
        "sea salt and ground pepper to taste",
        "4 ears grilled corn",
        "1 cup husked whole ground cherries",
        "1 cup cucumber, quartered lengthwise, deseeded, and chopped",
        "3 tablespoons basil, cut into a fine chiffonade",
        "2 tablespoons shallot, finely minced",
        "1 teaspoon jalapeno pepper, minced finely (add more if you prefer)"
      ],
      "tags": [
        "summer",
        "snack"
      ]
    },
    {
      "id": 7,
      "img": "https://images.food52.com/jWeqT0vuFuv3j6u_TOXOwDiFHps=/660x440/filters:format(webp)/444e0e81-7646-402e-ab23-e2a7c3aac6d8--2017-1130_genius-make-ahead-french-toast-casserole_3x2_bobbi-lin_4506.jpg",
      "video": "",
      "name": "Chrissy Teigen’s French Toast Casserole With Salted Frosted Flakes",
      "source": "https://food52.com/recipes/74530-chrissy-teigen-s-french-toast-casserole-with-salted-frosted-flakes",
      "author": "Genius Recipes",
      "mealtype": "Breakfast",
      "preptime": "13 hours",
      "cooktime": "60",
      "servings": "8",
      "comments": [],
      "instructions": [
        "Butter a 9 x 13-inch baking dish (or a tall-sided 12-inch ovenproof skillet) and arrange the cubed bread in the dish.",
        "In a big bowl, whisk the eggs to combine, then whisk in the heavy cream, milk, rum, brown sugar, vanilla, cinnamon, nutmeg, and salt until smooth. Pour the mixture over the bread, really pressing down on the bread to help the custard soak in. Cover with plastic wrap and refrigerate for at least 6 hours and up to 12.",
        "Heat the oven to 350°F. Take the casserole out of the fridge and let it sit at room temp for 30 minutes.",
        "Make the topping: In a bowl, combine the cereal, melted butter, and salt and toss to coat. Spread the mixture evenly over the casserole.",
        "Bake until the topping is golden and the bread cubes peeking out of the top are crusty and toasty, 50 to 55 minutes. Serve warm with maple syrup."
      ],
      "ingredients": [
        "1 tablespoon butter",
        "1 pound French bread (1 large loaf), cut into 1-inch pieces",
        "8 large eggs",
        "2 cups heavy cream",
        "1 cup whole milk",
        "1/2 cup rum (we used Meyer's dark rum)",
        "1 cup lightly packed light brown sugar",
        "1 tablespoon pure vanilla extract",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon freshly grated nutmeg",
        "1/2 teaspoon kosher salt",
        "3 cups Frosted Flakes cereal",
        "3 tablespoons unsalted butter",
        "1/2 teaspoon kosher salt"
      ],
      "tags": []
    },
    {
      "id": 8,
      "img": "https://goop-img.com/wp-content/uploads/2016/09/Shroomami-OLO.jpg",
      "video": "",
      "name": "Shroomami",
      "source": "https://goop.com/recipes/shroomami/",
      "author": "Goop",
      "mealtype": "Dinner",
      "preptime": "60",
      "cooktime": "30",
      "servings": "4",
      "comments": [],
      "instructions": [
        "To make the spicy sunflower seeds, preheat the oven to 350°F. Toss the seeds with the other ingredients in a large bowl, until well coated. Spread the coated seeds out on a baking sheet in a thin even layer. Bake for 15 minutes or until well toasted, allow to cool completely before using.",
        "To make the ginger miso dressing, combine all ingredients except the oil in a powerful blender and blitz on low until smooth. Increase the speed to medium and slowly add the grape seed oil. Add salt and pepper to taste.",
        "To make the roasted portobello mix, turn on your broiler and toss the mushrooms together with the oil and seasoning. Lay the mushrooms out on a baking sheet in a thin even layer. Place in the oven under the broiler for 10-12 minutes, or until well browned and softened, rotate the baking sheet if necessary for even broiling.   Set mushrooms aside to stay warm before serving.",
        "To make the roasted sesame tofu, cut the tofu into large bite sized pieces, toss with the oil, and season with salt and pepper. Place tofu on a baking sheet in a single layer, broil alongside the mushrooms for 15-20 minutes, or until browned and slightly crispy, remove pan from the broiler to mix and turn the pieces for even browning. Once the tofu is nice and crisp, toss it in a bowl with the remaining ingredients to marinade & coat the tofu pieces. Be careful handling hot tofu right out of the oven.",
        "When ready to serve, place the cooked wild rice in the bottom of a bowl, and top with remaining ingredients. Drizzle over dressing to taste."
      ],
      "ingredients": [
        "2 cups cooked wild rice, warm",
        "4 cups shredded kale",
        "1 medium beet, peeled, sliced into 1/4” bite sized pieces",
        "3/4 cup bean sprouts",
        "1 cup basil leaves",
        "1/2 cup spicy sunflower seeds (recipe below)",
        "1 1/2 cups roasted portobello mushroom mix",
        "1 1/2 cups sesame roasted tofu",
        "3/4 cup Miso Sesame Ginger Dressing ",
        "FOR THE SPICY SUNFLOWER SEEDS:",
        "2 cups raw sunflower seeds",
        "1 tablespoon chili powder",
        "1 tablespoon grapeseed oil",
        "1 clove garlic, minced",
        "1 teaspoon kosher salt",
        "1/2 teaspoon red chili flakes",
        "FOR THE ROASTED PORTOBELLO MIX:",
        "2 large portobello mushrooms, washed, stemmed, cut into 1” pieces",
        "1 cup white mushrooms, cut into large bite sized pieces",
        "1 tablespoon grape seed oil",
        "1 teaspoon kosher salt",
        "5-6 turns fresh cracked pepper",
        "FOR THE ROASTED SESAME TOFU:",
        "Extra firm tofu, drain and pat dry with a paper towel",
        "1 tablespoon grape seed Oil",
        "salt and pepper to taste",
        "1/4 cup scallions, sliced thin",
        "1/4 cup tamari",
        "1 teaspoon chili flakes",
        "1/4 cup cilantro, chopped",
        "1/4 cup water",
        "1/2 tsp Sesame Oil",
        "FOR THE GINGER MISO DRESSING:",
        "2 tablespoons sweet white miso paste",
        "2 Tbsp Tamari or Soy Sauce",
        "1 Tbsp Red Chili Flakes (optional)",
        "2 Tbsp Rice Vinegar",
        "1/2 tsp Sesame Oil",
        "1/4 cup Warm Water",
        "2 Tbsp Mirin",
        "1 Thumb Sized Piece of Ginger, Peeled and Minced",
        "1 Garlic Clove, Smashed and Minced",
        "1/2 cup Grape Seed Oil"
      ],
      "tags": [
        "so many things!"
      ]
    },
    {
      "id": 9,
      "img": "https://thehealthyfoodie.com/wp-content/uploads/2016/11/Hasselback-Butternut-Squash.jpg",
      "video": "",
      "name": "Honey Glazed Hasselback Butternut Squash",
      "source": "https://thehealthyfoodie.com/hasselback-butternut-squash/",
      "author": "Soniai The Healthy Foodie",
      "mealtype": "Dinner",
      "preptime": "20",
      "cooktime": "75",
      "servings": "6",
      "comments": [
        "Tastes great but takes forever!"
      ],
      "instructions": [
        "Preheat your oven to 425°F and place a rack in the top third position.",
        "Carefully cut the butternut squash in half lengthwise, then scoop out the seeds and pulp and discard. Next, with the help of a vegetable peeler, remove the tough outer skin as well as the thin whitish layer beneath it, in order to completely expose the bright orange flesh of the gourd.",
        "Place both squash halves cut side down on a roasting pan and bake for 20 minutes; remove from oven and let cool until you can safely handle the squash with your bare fingers, about 5 minutes.",
        "While the squash is in the oven, combine the honey, olive oil, Dijon mustard, chopped herbs, salt and pepper in a small bowl and mix well with a small whisk until completely combined.",
        "Remove one squash half to a cutting board and place the handle of a wooden spoon (or other wooden utensil) on either side of the squash. These will act as guards and will prevent your blade from going all the way as you slice through the squash. With the help of a sharp knife, carefully cut very thin slits in the squash, starting at the narrow end; always be mindful not to cut all the way through. Return the sliced squash to the baking sheet and repeat with the second half.",
        "Brush about 1/3 of the honey mixture over the squash halves, trying as best you can to force the mixture down the slits. Add 1/4 cup of water to the bottom of the pan and return to oven for 15 minutes.",
        "When the squash is in the oven, always keep a close eye on things to make sure that the syrup at the bottom of the pan doesn't burn; add a little bit more water, a few tablespoons at a time, if necessary.",
        "After 15 minutes, remove the squash from the oven and brush with more of the honey mixture as well as with some of the cooking liquid that's now at bottom of the pan (this will add tons of color and flavor!)",
        "Add another 1/4 cup water to bottom of the pan and return to the oven for a further 15 minutes.",
        "Remove the squash from the oven once more and brush it with some of the pan juices.",
        "Add the chopped pecans to the remaining honey glaze and stir to combine. Spoon that mixture over the top of the squash, dividing it equally between both halves.",
        "Add another 1/4 cup water to bottom of the roasting pan and return it to the oven for a final 5 minutes, or until the squash is beautifully golden and tender.",
        "Remove from oven; spoon some of the pan juices over the squash, sprinkle with a little bit of fresh herbs and a pinch of salt."
      ],
      "ingredients": [
        "1 medium butternut squash, about 1kg | 2.2lb",
        "1/4 cup unpasteurized honey (or maple syrup)",
        "2 tbsp extra-virgin olive oil",
        "1 tbsp Dijon mustard",
        "1 tbsp finely chopped fresh sage leaves",
        "1 tsp finely chopped fresh thyme",
        "1 tsp salt",
        "1/2 tsp ground black pepper",
        "3-4 Tbsp chopped pecans"
      ],
      "tags": [
        "fall harvest",
        "Loren's favorites"
      ]
    },
    {
      "id": 10,
      "img": "https://www.4theloveoffoodblog.com/wp-content/uploads/2014/11/IMG_0966-806x1024.jpg",
      "video": "",
      "name": "Eggplant Manicotti",
      "source": "https://www.4theloveoffoodblog.com/meatless-monday-eggplant-manicotti/",
      "author": "Rocco Dispirito",
      "mealtype": "Dinner",
      "preptime": "20",
      "cooktime": "40",
      "servings": "6",
      "comments": [
        "Use this as a base recipe for regular manicotti or stuffed shells"
      ],
      "instructions": [
        "Preheat oven to 450 degrees. Line two baking sheets with parchment paper.",
        "Using a large, sharp knife, square off the eggplant to make a block about 6 inches long and 4 inches wide. Slice the eggplant lengthwise into 8 slices that are about 1/6 inch thick.",
        "Lay the eggplant slices in a single layer on the prepared baking sheets. Season the eggplant with salt and pepper to taste and spray lightly with olive oil spray (or brush on olive oil).",
        "Roast until the eggplant is almost tender, about 20 minutes. Let it cool slightly. (Leave the oven on).",
        "While the eggplant is cooling, combine the ricotta, 1/4 cup of the Parmigiano-Reggiano, and the basil in a medium bowl. Season with salt and pepper to taste.",
        "Spread 3/4 cup of the marinara sauce over the bottom of a 8X10 baking dish.",
        "Lay the roasted eggplant out and spoon one eighth of the ricotta mixture onto the bottom of each piece of eggplant, and then roll it up, jelly-roll style, to encase the filling.",
        "Nestle the 8 eggplant “manicotti”, seam side down, in the baking dish.",
        "Spoon the remaining 3/4 cup marinara sauce over the eggplant.",
        "Sprinkle with the mozzarella and remaining 1/4 cup Parmigiano-Reggiano.",
        "Bake until cheese is bubbly and the filling is hot, about 18 minutes. Serve immediately."
      ],
      "ingredients": [
        "1 large eggplant (about 8 inches long and 5 inches in diameter) ",
        "1 cup fat free ricotta",
        "1/2 cup grated Parmigiano-Reggiano cheese",
        "1/2 cup chopped basil",
        "1 1/2 cups low fat jarred marinara sauce",
        "1 cup shredded low fat mozzarella cheese",
        "salt and pepper, to taste",
        "non stick olive oil spray (or use a basting brush to apply oil)"
      ],
      "tags": []
    },
    {
      "img": "https://www.simplyrecipes.com/thmb/PxA1yC6dfvcHGqTn0O9i3UGh-HU=/648x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2016__09__Buttermilk-Waffles-vertical-a-1600-78c479c180cc4c8986034cf90bb63f48.jpg",
      "video": "",
      "name": "Dad's Waffles",
      "source": "",
      "author": "Dad",
      "mealtype": "Breakfast",
      "preptime": "10",
      "cooktime": "20",
      "servings": "28",
      "instructions": [
        "Place all ingredients into bowl + mix except egg whites",
        "Mix (whip) egg whites in separate bowl",
        "Fold whites into batter gently until folded completely.",
        "Pour into hot waffle iron until crisp.",
        "Enjoy"
      ],
      "ingredients": [
        "3 eggs - separate whites",
        "1 1/2 cup milk",
        "1 3/4 cup flour",
        "2 tsp baking powder",
        "1 tsp baking soda",
        "1/2 tsp salt",
        "1/2 vegetable oil"
      ],
      "id": 11,
      "comments": []
    },
    {
      "img": "https://assets.bonappetit.com/photos/57ad307953e63daf11a4dcb7/1:1/w_1280,c_limit/apple-dutch-baby.jpg",
      "video": "",
      "name": "Apple Dutch Baby",
      "source": "https://www.bonappetit.com/recipe/apple-dutch-baby",
      "author": "The North Shire Lodge, Manchester, VT",
      "mealtype": "Dinner",
      "preptime": "10",
      "cooktime": "25",
      "servings": "4",
      "instructions": [
        "Bring cider, butter, brown sugar, vanilla, and cinnamon to a boil over medium-high heat in a large saucepan. Reduce heat and boil gently, whisking occasionally, until thick and syrupy, 30–45 minutes.",
        "Preheat oven to 425°. Whisk eggs, milk, flour, vanilla, salt, and ½ tsp. cinnamon in a medium bowl until smooth.",
        "Melt 2 Tbsp. butter in a 10” skillet, preferably cast iron, over medium heat. Add apple and sprinkle with brown sugar and remaining ½ tsp. cinnamon. Cook, tossing often, until apple is coated and softened, about 4 minutes. Transfer to a plate.",
        "Wipe out skillet and heat in oven until very hot, 8–10 minutes. Carefully add remaining 2 Tbsp. butter to skillet, tilting to coat bottom and sides. Add apple to center of skillet; pour batter over. Bake until pancake is puffed and golden brown around the edges and center is set but still custardy, 12–15 minutes.",
        "Serve drizzled with apple cider syrup."
      ],
      "ingredients": [
        "3  large eggs, room temperature",
        "3/4  cup whole milk, room temperature",
        "3/4 cup all-purpose flour",
        "1  teaspoon vanilla extract",
        "1/4 teaspoon kosher salt",
        "1  teaspoon ground cinnamon, divided",
        "4  tablespoons unsalted butter, divided",
        "1  large Pink Lady apple, peeled, sliced ¼” thick",
        "1  tablespoon light brown sugar",
        "4  cups apple cider",
        "2  tablespoons unsalted butter",
        "1  tablespoon light brown sugar",
        "1  teaspoon vanilla extract",
        "1/2  teaspoon ground cinnamon"
      ],
      "comments": [
        "Use this batter recipe as a base for other dutch baby adventures!"
      ],
      "id": 12
    },
    {
      "img": "https://thiswifecooks.com/wp-content/uploads/2021/05/A359F5BC-32BE-4693-84EE-5AA57D73D91C_1_105_c.jpg",
      "video": "",
      "name": "Vegan Sloppy Joes",
      "source": "",
      "author": "Derik",
      "mealtype": "Lunch",
      "preptime": "5",
      "cooktime": "25",
      "servings": "4",
      "instructions": [
        "In a large skillet, saute the onion and bell peppers in olive oil for 3 to 5 minutes or until onions are soft.",
        "Reduce heat to medium-low and add the vegetable broth and tomato sauce, stirring to combine well. Once the broth and tomato sauce is combined and hot, add the chili powder, soy sauce, hot sauce or Tabasco sauce, sugar, and TVP, stirring well to combine.",
        "Allow to simmer for at least 15 more minutes and season well with salt and pepper."
      ],
      "ingredients": [
        "1/2 onion (diced)",
        "1 pepper (diced) (I used a poblano)",
        "1 1/2 cups vegetable broth",
        "1 can tomato sauce",
        "1 tbsp. chili powder",
        "1 tbsp. soy sauce",
        "A few dashes of hot sauce (personally, I'd use even more)",
        "3 tbsp. sugar",
        "1 1/2 cups TVP",
        "Salt and pepper to taste"
      ],
      "comments": [],
      "id": 13
    },
    {
      "img": "https://assets.bonappetit.com/photos/58c98b0948ee007350aee2da/1:1/w_1600,c_limit/bucatini-with-swiss-chard-and-garlicky-breadcrumbs.jpg",
      "video": "",
      "name": "Bucatini with Swiss Chard and Garlicky Breadcrumbs",
      "source": "https://www.bonappetit.com/recipe/bucatini-with-swiss-chard-and-garlicky-breadcrumbs",
      "author": "Andy Baraghani",
      "mealtype": "Dinner",
      "preptime": "15",
      "cooktime": "15",
      "servings": "4",
      "instructions": [
        "Heat 2 Tbsp. oil in a small skillet over medium. Cook garlic, swirling in pan often, until golden and crisp, about 2 minutes. Transfer garlic to a small bowl with a slotted spoon.",
        "Add panko to same skillet and cook, stirring often, until golden, about 5 minutes; season with salt and pepper. Transfer to bowl with garlic.",
        "Cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente. Drain, reserving 1 cup pasta cooking liquid.",
        "Meanwhile, heat 3 Tbsp. oil in a large skillet over medium. Cook anchovies, mashing with a wooden spoon, until only a few flecks remain, about 4 minutes. Add chile and Swiss chard and cook until Swiss chard is slightly wilted, about 1 minute.",
        "Add butter, pasta, and ½ cup pasta cooking liquid to Swiss chard mixture and cook, tossing often with tongs and adding more pasta cooking liquid if sauce looks dry, until sauce is emulsified and coats pasta. Remove from heat and stir in mint, lemon zest, and lemon juice.",
        "Divide pasta among bowls. Drizzle with oil; top with garlicky breadcrumbs and Pecorino."
      ],
      "ingredients": [
        "5  tablespoons olive oil, divided, plus more for drizzling",
        "4  garlic cloves, thinly sliced",
        "1/3 cup panko (Japanese breadcrumbs)",
        " Kosher salt, freshly ground pepper",
        "12  ounces bucatini or spaghetti",
        "5  oil-packed anchovy fillets, finely chopped",
        "1  serrano chile, thinly sliced",
        "1  bunch small Swiss chard, ribs and stems removed, leaves coarsely torn (about 5 cups)",
        "3  tablespoons unsalted butter, cut into pieces",
        "1  cup coarsely chopped mint",
        "1  cup coarsely chopped mint",
        "2  teaspoons fresh lemon juice",
        " Finely grated Pecorino (for serving)"
      ],
      "comments": [
        "Easily scaled up for groups!"
      ],
      "id": 14
    },
    {
      "img": "https://assets.bonappetit.com/photos/5f0612ea4714d90f946d2031/16:9/w_1280,c_limit/0820-Farmers-Market-Farro-Bowl.jpg",
      "video": "",
      "name": "Farmers Market Farro Bowls",
      "source": "https://www.bonappetit.com/recipe/farmers-market-farro-bowls",
      "author": "Christina Chaey",
      "mealtype": "Lunch",
      "preptime": "20",
      "cooktime": "45",
      "servings": "4",
      "instructions": [
        "Pour farro into a medium saucepan of boiling salted water, reduce heat, and simmer, stirring occasionally, until tender, 25–30 minutes. Drain farro and spread out on a rimmed baking sheet; let cool.",
        "Meanwhile, using a slotted spoon, carefully lower eggs into a small saucepan of boiling water and cook 6½ minutes for an oozy, jammy yolk or 7 minutes for a slightly firmer middle. Transfer eggs to a bowl of ice water with slotted spoon and let sit until cool enough to handle, about 2 minutes. Remove eggs from ice water; peel and slice in half lengthwise.",
        "Pack radish slices into a pint jar. Whisk vinegar, 1 Tbsp. sugar, 1 tsp. salt, and ½ cup hot water in a small bowl until sugar and salt are dissolved. Pour brine over radish slices; let cool. Cover and chill at least 1 hour before using.",
        "Cut tofu crosswise into 1/2\"-thick slabs, then cut each slab on a diagonal to create 2 triangles. Pat dry with a clean kitchen towel. Heat 2 Tbsp. grapeseed oil in a large nonstick skillet over medium-high. Add tofu in a single layer, season with salt, and cook, undisturbed, until golden brown underneath, about 4 minutes. Turn over and cook until golden brown on second side, about 4 minutes. Transfer tofu to a plate; reserve skillet (no need to wipe out).",
        "Whisk lime juice, gochujang, mayonnaise, ¼ cup grapeseed oil, 1 Tbsp. soy sauce, 1 Tbsp. sesame oil, and remaining 1 Tbsp. sugar in a small bowl. Taste; season with salt if desired.",
        "Heat remaining 1 Tbsp. grapeseed oil in reserved skillet over medium-high. Add zucchini, season with salt, and cook, tossing just once or twice, until tender and blistered in spots, about 4 minutes. Add remaining 1 tsp. soy sauce and 1 tsp. sesame oil and toss to coat. Transfer to a plate.",
        "To serve, divide farro among bowls. Arrange eggs, drained pickled radish, tofu, zucchini, and raw vegetables of choice on top as desired. Drizzle each bowl with a few spoonfuls of dressing to your liking."
      ],
      "ingredients": [
        "1 cup semi-pearled farro",
        "1 tsp. kosher salt, plus more",
        "4 large eggs",
        "1 large watermelon radish or 6–8 red radishes, trimmed, thinly sliced on a mandoline if you’ve got one",
        "1/4 cup unseasoned rice vinegar",
        "2 Tbsp. sugar, divided",
        "1 14-oz. block extra-firm tofu, drained",
        "3 Tbsp. plus 1/4 cup grapeseed or vegetable oil, divided",
        "2 Tbsp. fresh lime juice",
        "2 Tbsp. gochujang (Korean hot pepper paste)",
        "1 Tbsp. mayonnaise",
        "1 Tbsp. plus 1 tsp. soy sauce",
        "1 Tbsp. plus 1 tsp. toasted sesame oil",
        "1 medium zucchini or summer squash, halved lengthwise, cut crosswise into 1/4\"-thick half-moons",
        "2–3 cups thinly sliced or shredded raw vegetables (such as carrots, scallions, blanched sugar snap peas, baby bok choy, cucumbers, pea shoots, or alfalfa sprouts)"
      ],
      "comments": [],
      "id": 15
    },
    {
      "img": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F9%2F2013%2F12%2F06%2F200707-xl-over-the-top-mushroom-quiche.jpg",
      "video": "",
      "name": "Over-the-Top Mushroom Quiche",
      "source": "https://www.foodandwine.com/recipes/over-top-mushroom-quiche",
      "author": "Thomas Keller",
      "mealtype": "Breakfast",
      "preptime": "90 mins",
      "cooktime": "5.5 hrs",
      "servings": "12",
      "instructions": [
        "Preheat the oven to 325°. In a very large skillet, heat the oil. Add the oyster and white mushrooms, season with salt and pepper and cook over high heat, stirring, until starting to soften, about 5 minutes. Reduce the heat to moderate. Add the butter, shallots and thyme and cook, stirring often, until the mushrooms are tender, about 12 minutes longer. Season with salt and pepper and let cool.",
        "Scatter 1/4 cup of the cheese and half of the mushrooms evenly over the bottom of the Buttery Pastry Shell. In a blender, mix half each of the milk, cream and eggs and season with 1 1/2 teaspoons of salt, 1/8 teaspoon of pepper and a pinch of nutmeg at high speed until frothy, about 1 minute. Pour the custard into the pastry shell. Top with another 1/4 cup of cheese and the remaining mushrooms. Make a second batch of custard with the remaining milk, cream and eggs, plus the same amount of salt, pepper and nutmeg as before and pour into the shell. Scatter the remaining 1/4 cup of cheese on top.",
        "Bake the quiche for about 1 1/2 hours, or until richly browned on top and the custard is barely set in the center. Let cool in the pan until very warm.",
        "Using a serrated knife, cut the pastry shell flush with the top of the pan. Carefully lift the springform pan ring off the quiche. Cut the mushroom quiche into wedges, transfer to plates and serve warm."
      ],
      "ingredients": [
        "1 tablespoon vegetable oil",
        "1 pound oyster mushrooms, stems trimmed and large caps halved or quartered",
        "1 pound white mushrooms, thinly sliced",
        "Salt and freshly ground white pepper",
        "1 tablespoon unsalted butter",
        "2 small shallots, minced",
        "1 tablespoon thyme, chopped",
        "3/4 cup shredded Comté or Emmental cheese (2 1/2 ounces)",
        "Buttery Pastry Shell",
        "2 cups milk",
        "2 cups heavy cream",
        "6 large eggs, lightly beaten",
        "Freshly grated nutmeg"
      ],
      "comments": [],
      "id": 16
    },
    {
      "img": "https://www.rabbitandwolves.com/wp-content/uploads/2018/07/DSC_0872.jpg",
      "video": "",
      "name": "Vegan Caesar Pasta Salad",
      "source": "https://www.rabbitandwolves.com/caesar-pasta-salad-vegan/#recipe",
      "author": "Lauren Hartmann",
      "mealtype": "Side",
      "preptime": "10 mins",
      "cooktime": "30 mins",
      "servings": "6",
      "instructions": [
        "Cook your pasta according to package directions. Drain and let cool. ",
        "Make the dressing. Add all the dressing ingredients to a blender. Blend until smooth, taste and adjust seasoning. ",
        "Once the croutons are done, in a large bowl, add the chopped romaine, pasta, croutons and then pour the dressing on and toss. Serve immediately. "
      ],
      "ingredients": [
        "1/2 C. Vegan Mayo",
        "2 tsp. Dijon mustard",
        "1 Tbsp. Capers",
        "Juice of 2 Lemons, about 2 Tbsp.",
        "2 Tbsp. Nutritional yeast",
        "1 Clove Garlic",
        "1/4 tsp. Salt",
        "Pinch of black pepper",
        "1 Head Romaine, chopped",
        "16 oz. Pasta"
      ],
      "comments": [
        "Omitted the crouton portion of the recipe as we don't make them.",
        "Mini penne is perfect",
        "We don't use nutritional yeast in our dressing, and only use half a lemon."
      ],
      "id": 17
    },
    {
      "img": "https://assets.bonappetit.com/photos/5b75977fbb4c7973c8ddb798/16:9/w_1280,c_limit/basically-corn-salsa-01.jpg",
      "video": "",
      "name": "Corn Salsa",
      "source": "https://www.bonappetit.com/recipe/corn-salsa",
      "author": "Claire Saffitz",
      "mealtype": "Snack",
      "preptime": "15",
      "cooktime": "",
      "servings": "Makes about 2 cups",
      "instructions": [
        "Remove husks and silk from 2 ears of corn. Cook corn and 1 poblano chile in a dry medium cast-iron skillet over high heat, turning occasionally, until corn is charred in spots and chile is blistered all over, 10–14 minutes.",
        "Transfer corn and chile to a cutting board and let cool for a minute or two. Lay corn flat and slice along one side to shave off kernels. Repeat, rotating cob, until all kernels have been cut off. Discard cobs. Transfer corn to a medium bowl.",
        "Crush corn with a potato masher or wooden spoon to help release starch and juices, which will help to thicken the salsa slightly. (Also a good way to get out a little aggression.)",
        "Cut around poblano chile stem to remove, then slice into flesh lengthwise to open up chile like a book. Scrape out seeds and ribs, flip over, then use the dull edge of your knife to scrape off charred skin and discard.",
        "Coarsely chop chile and add to bowl with corn.",
        "Do a little bit more knife work: Cut stem end off of 1 jalapeño, then halve lengthwise. Pull out ribs and seeds, then finely chop flesh. Add to bowl with corn.",
        "Finely chop ½ red onion and add to bowl as well. Season with ½ tsp. salt and give it all a good mix with a large spoon.",
        "Core 1 tomato, then cut in half through its equator. Squeeze tomato halves over a bowl or trash to push out seeds and watery parts and discard. Chop tomato flesh and gently fold into salsa.",
        "Pick ¼ cup cilantro leaves from stems. Very finely chop leftover stems and fold into salsa along with leaves.",
        "Cut 1 lime in half and squeeze with your hands into a small bowl. Measure out 2 Tbsp. and add to corn mixture. Taste and season with more salt. Mix one more time to combine.",
        "Stir in herbs right before serving."
      ],
      "ingredients": [
        "2 medium ears of corn",
        "1 medium poblano chile",
        "1 medium jalapeño or Fresno chile",
        "1/2 small red onion",
        "1/2 tsp. kosher salt, plus more",
        "1 large ripe beefsteak tomato",
        "1/4 bunch cilantro",
        "1 lime",
        "Tortilla chips (for serving)"
      ],
      "comments": [],
      "id": 18
    },
    {
      "img": "https://assets.bonappetit.com/photos/57ae3e2ef1c801a1038bd180/16:9/w_1028,c_limit/oven-roasted-flounder-with-bok-choy-cilantro-and-lime.jpg",
      "video": "",
      "name": "Oven-Roasted Flounder with Bok Choy, Cilantro, and Lime",
      "source": "https://www.bonappetit.com/recipe/oven-roasted-flounder-with-bok-choy-cilantro-and-lime",
      "author": "The Bon Appetit Test Kitchen",
      "mealtype": "Dinner",
      "preptime": "15",
      "cooktime": "10",
      "servings": "4",
      "instructions": [
        "Arrange a rack in upper third of oven; preheat to 400°. Combine scallion, 1/4 cup cilantro, and next 4 ingredients in a small bowl. Whisk in 1 1/2 tablespoon oil. Season cilantro-lime sauce with salt and pepper; set aside.",
        "Heat remaining 2 tablespoons oil in a large skillet over high heat until shimmering. Working in batches if needed, add bok choy, cut side down, and sear until golden brown, 2-4 minutes per batch. Turn bok choy cut side up and remove pan from heat. Add sake. Season flounder fillets with salt and pepper and arrange in a single layer over bok choy. Roast in oven until fish is just cooked through, 8-10 minutes.",
        "Spoon sake sauce from skillet into the bottom of 4 shallow bowls, dividing evenly. Add bok choy to each bowl, dividing evenly; top each bowl with 1 fish fillet. Spoon some cilantro-lime sauce over fish and garnish with cilantro sprigs. Serve remaining cilantro-lime sauce alongside for drizzling."
      ],
      "ingredients": [
        "1 scallion, thinly sliced",
        "1/4 cup coarsely chopped cilantro plus small sprigs for garnish",
        "1/4 cup fresh lime juice",
        "3 tablespoons reduced-sodium soy sauce",
        "2 tablespoons unseasoned rice vinegar",
        "2 teaspoons finely minced peeled ginger",
        "3 1/2 tablespoons vegetable oil, divided",
        "Kosher salt and freshly ground black pepper",
        "1 pound baby bok choy (2-3 bunches), cut in half lengthwise",
        "1/2 cup sake or dry white wine",
        "4 4-ounce fillets flounder or other delicate white fish (up to 1/2 inch thick)"
      ],
      "comments": [],
      "id": 19
    },
    {
      "img": "https://hips.hearstapps.com/hmg-prod/images/delish-210608-millie-peartree-mac-and-cheese-351-vertical-macro-v1-eb-1631547578.jpg",
      "video": "",
      "name": "Patti Labelle's Macaroni and Cheese",
      "source": "https://www.keyingredient.com/recipes/423366537/patti-labelles-macaroni-and-cheese/",
      "author": "Patti Labelle",
      "mealtype": "Dinner",
      "preptime": "15",
      "cooktime": "35",
      "servings": "8",
      "instructions": [
        "Preheat oven to 350.",
        "Lightly butter a deep 2 1/2 quart baking dish.",
        "Fill a large pot with water and bring to a rapid boil.",
        "Add macaroni and the 1 tablespoon oil.",
        "Cook for 7 minutes, or until somewhat tender.",
        "Drain well, and return to the pot.",
        "Meanwhile, in a small saucepan, melt 8 tablespoon of the butter.",
        "Stir into macaroni.",
        "In a large bowl, combine all of the shredded cheeses.",
        "To the macaroni, add 1 1/2 cups of shredded cheeses, half and half, the cubed cheese and the eggs, and the seasoned salt and pepper.",
        "Transfer to the prepared casserole dish, and top with remaining 1/2 cup shredded cheese.",
        "Dot with remaining 1 TB of the butter.",
        "Bake for 30-35 minutes or until the edges are golden brown and bubbly."
      ],
      "ingredients": [
        "1 tablespoon vegetable oil",
        "1 lb macaroni",
        "8 tablespoons butter",
        "1 tablespoon butter",
        "1/2 cup muenster cheese, shredded",
        "1/2 cup mild cheddar cheese, shredded",
        "1/2 cup sharp cheddar cheese, shredded",
        "1/2 cup monterey jack cheese, shredded",
        "2 cups half-and-half",
        "8 ounces Velveeta cheese, cubed",
        "2 eggs, lightly beaten",
        "1/4 teaspoon seasoning salt",
        "1/8 teaspoon fresh ground pepper"
      ],
      "comments": [],
      "id": 20
    },
    {
      "img": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,w_1000/k%2Farchive%2Fa9696fb4dd17254516d5ebca8e3705ac7243dcfa",
      "video": "",
      "name": "Pasta Primavera",
      "source": "https://www.thekitchn.com/how-to-make-one-pot-pasta-primavera-256072",
      "author": "Patty Catalano",
      "mealtype": "Dinner",
      "preptime": "10 mins",
      "cooktime": "20 mins",
      "servings": "6",
      "instructions": [
        "Make a garlic-lemon butter. Mince and mash the garlic and 1/2 teaspoon of the salt together to make a paste. Transfer to a small bowl, add 4 tablespoons of the butter and the lemon zest, and mash together until combined; set aside."
      ],
      "ingredients": [
        "2 cloves garlic, smashed"
      ],
      "comments": [
        "So good with lots of cheese on top"
      ],
      "id": 21
    }
  ]
}